DataProcessors/Renault_Статистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_Статистика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_Статистика/Ext/ObjectModule.bsl
Перем Поток Экспорт;
Перем BIR Экспорт;
Перем ВерсияDMS Экспорт;
Перем ПутьКФайлу Экспорт;
Перем Организация Экспорт;

Перем СоответствиеПотоков;


Функция ПолучитьIP()
	Попытка
		
		WinSock = Новый COMОбъект("MSWinsock.Winsock");
		
		Возврат WinSock.LocalIP;
		
	Исключение
		
		//Если через WinSock не получилось получить IP - получим через WMI.
		
		ИмяКомпьютера = ИмяКомпьютера();
		objWMIService = ПолучитьCOMОбъект("winmgmts:\\" + ИмяКомпьютера + "\root\CIMV2");
		IPConfigSet = objWMIService.ExecQuery("SELECT * FROM Win32_NetworkAdapterConfiguration where IPEnabled=TRUE",,48);
		
		//Берем первый, не пустой IP
		Для Каждого IPConfig Из IPConfigSet Цикл 
			
			Для Каждого Стр Из IPConfig.IPAddress Цикл
				
				Если НЕ Стр = "0.0.0.0" тогда
					Возврат Стр;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьСтатистику() Экспорт
	
КонецПроцедуры

Процедура ОтправитьСтатистикуПоТДФА() Экспорт
	
	НомерФайла = ПолучитьНомерSTA();
	
	Если НЕ ЗначениеЗаполнено(НомерФайла) Тогда
		НомерФайла = 1;
	КонецЕсли;
	
	IP = ПолучитьIP();
	
	КраткоеИмя = СтрЗаменить("" + BIR + ".BIR.STA." + BIR + "." + Формат(НомерФайла,"ЧЦ=4; ЧВН=; ЧГ=0"), " ","");
	ИмяФайла = ?(Прав(ПутьКФайлу,1) = "\", ПутьКФайлу, ПутьКФайлу+"\") + КраткоеИмя;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	//Заголовок
	ТекстовыйДокумент.ДобавитьСтроку("*S*" + BIR + "*S*");
	ТекстовыйДокумент.ДобавитьСтроку("BIR=" + BIR);
	ТекстовыйДокумент.ДобавитьСтроку("streams=" + СоответствиеПотоков[Поток]);
	ТекстовыйДокумент.ДобавитьСтроку("conndate="+ Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd%20HH:mm:ss"));
	ТекстовыйДокумент.ДобавитьСтроку("ipclients=" + IP);
	ТекстовыйДокумент.ДобавитьСтроку("releasedms=" + ВерсияDMS);
	
	ТекстовыйДокумент.Записать(ИмяФайла, КодировкаТекста.ANSI);
	
	//Запишем новый номер в свойство Организация
	СвойствоВидИспользования = ПланыВидовХарактеристик.СвойстваОбъектов.НомерФайлаSTA;
	
	НаборЗаписейЗначенияСвойствОбъектов								= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Значение 		= Организация;
	НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Использование 	= Истина;
	НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Значение 	= СвойствоВидИспользования;
	НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Использование= Истина;
	НаборЗаписейЗначенияСвойствОбъектов.Прочитать();
	НаборЗаписейЗначенияСвойствОбъектов.Очистить();
	
	НоваяЗапись 		 = НаборЗаписейЗначенияСвойствОбъектов.Добавить();
	НоваяЗапись.Объект 	 = Организация;
	НоваяЗапись.Свойство = СвойствоВидИспользования;
	НоваяЗапись.Значение = НомерФайла + 1;
	
	Попытка
		НаборЗаписейЗначенияСвойствОбъектов.Записать();
	Исключение
		
		Renault_Открытый.СообщитьПользователю("Не удалось записать значение свойства  " + Строка(СвойствоВидИспользования) + " для " + Организация.Наименование, СтатусСообщения.Важное);	
		
	КонецПопытки;

	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьНомерSTA()
	
	НомерФайла	= Renault_ОбщийМодуль.ПолучитьЗначениеСвойства(Организация,"НомерФайлаSTA");
	Возврат НомерФайла;
	
КонецФункции

СоответствиеПотоков = Новый Соответствие;

Для каждого Значение из Перечисления.ПотокиTDFa Цикл
	
	СоответствиеПотоков.Вставить(Значение, Метаданные.Перечисления.ПотокиTDFa.ЗначенияПеречисления[Перечисления.ПотокиTDFa.Индекс(Значение)].Имя);
	
КонецЦикла;
